app/views/doctors/_form.html.erb

    <%= f.label :specialty_id %>
    <%= f.select :specialty_id, Specialty.all.collect {|x| [x.specialty, x.id]} %>
---
SELECT "specialties".* FROM "specialties"