app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = $1  [["patient_id", 6]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1  [["doctor_id", 13]]
---
  def index
    if @current_user.admin
      @appointments = Appointment.all
    elsif @current_user.patient
      @appointments = Appointment.where(patient_id: @current_user.patient.id)
    elsif @current_user.doctor
      puts "HEREHERE"
      @appointments = Appointment.where(doctor_id: @current_user.doctor.id)

SELECT "doctors".* FROM "doctors"
SELECT "days".* FROM "days"
SELECT "timeslots".* FROM "timeslots"
SELECT "complaints".* FROM "complaints"
---
  def new
    @appointment = Appointment.new
    @doctors = Doctor.all
    @days = Day.all
    @timeslots = Timeslot.all
    @complaints = Complaint.all

SELECT "doctors".* FROM "doctors"
SELECT "days".* FROM "days"
SELECT "timeslots".* FROM "timeslots"
SELECT "complaints".* FROM "complaints"
INSERT INTO "appointments" ("patient_id", "doctor_id", "date_id", "timeslot_id", "complaint_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["patient_id", 3], ["doctor_id", 1], ["date_id", 1], ["timeslot_id", 1], ["complaint_id", 1], ["created_at", 2016-10-05 14:41:06 UTC], ["updated_at", 2016-10-05 14:41:06 UTC]]
---
  def create
    @appointment = Appointment.new(appointment_params)
    @doctors = Doctor.all
    @days = Day.all
    @timeslots = Timeslot.all
    @complaints = Complaint.all
    set_patient
    @appointment.patient_id = @patient.id
    puts "CHECKCHECK"
    puts @appointment.inspect

    if current_user
      respond_to do |format|
        if @appointment.save

SELECT  "patients".* FROM "patients" WHERE "patients"."user_id" = $1 LIMIT $2  [["user_id", "3"], ["LIMIT", 1]]
---
  def set_patient
    @patient = Patient.where(user_id: @current_user.id).take