app/controllers/complaints_controller.rb

SELECT "complaints".* FROM "complaints"
---
  def index
    @complaints = Complaint.all

INSERT INTO "complaints" ("complaint", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["complaint", "flu"], ["created_at", 2016-10-05 10:40:34 UTC], ["updated_at", 2016-10-05 10:40:34 UTC]]
---
  def create
    @complaint = Complaint.new(complaint_params)

    respond_to do |format|
      if @complaint.save

SELECT  "complaints".* FROM "complaints" WHERE "complaints"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_complaint
      @complaint = Complaint.find(params[:id])