app/controllers/days_controller.rb

  def index
    @days = Day.all
---
SELECT "days".* FROM "days"

  def create
    @day = Day.new(day_params)

    respond_to do |format|
      if @day.save
---
INSERT INTO "days" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", "05/10/2016"], ["created_at", 2016-10-05 09:51:30 UTC], ["updated_at", 2016-10-05 09:51:30 UTC]]

    def set_day
      @day = Day.find(params[:id])
---
SELECT  "days".* FROM "days" WHERE "days"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]