app/controllers/doctors_controller.rb

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @doctor = Doctor.find(params[:id])

SELECT "patients".* FROM "patients"
SELECT "doctors".* FROM "doctors"
---
  def new
    @doctor = Doctor.new
    @patients = Patient.all
    @doctors = Doctor.all

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @doctor = Doctor.find(params[:id])

INSERT INTO "doctors" ("user_id", "name", "specialty_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 9], ["name", "Victor"], ["specialty_id", ""], ["created_at", 2016-10-06 00:23:33 UTC], ["updated_at", 2016-10-06 00:23:33 UTC]]
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."user_id" = $1 LIMIT $2  [["user_id", :user_id], ["LIMIT", 1]]
DELETE FROM "doctors" WHERE "doctors"."id" = $1  [["id", 12]]
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 7]]
INSERT INTO "patients" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", "9"], ["name", "Victor"], ["created_at", 2016-10-06 00:40:15 UTC], ["updated_at", 2016-10-06 00:40:15 UTC]]
---
  def create
    if params[:type] == 'doctor'
      @doctor = Doctor.new(params.permit(:user_id, :name))
      @doctor.save
      @patient = Patient.where(user_id: @doctor.user_id).take
      @patient.destroy
      redirect_to '/doctors/new'
    elsif params[:type] = 'patient'
      @patient = Patient.new(params.permit(:user_id, :name))
      @patient.save

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
---
    def set_doctor
      @doctor = Doctor.where(user_id: @current_user.id).take