app/controllers/specialties_controller.rb

SELECT "specialties".* FROM "specialties"
---
  def index
    @specialties = Specialty.all

INSERT INTO "specialties" ("specialty", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["specialty", "Cardiologists"], ["created_at", 2016-10-06 03:25:33 UTC], ["updated_at", 2016-10-06 03:25:33 UTC]]
---
  def create
    @specialty = Specialty.new(specialty_params)

    respond_to do |format|
      if @specialty.save

SELECT  "specialties".* FROM "specialties" WHERE "specialties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_specialty
      @specialty = Specialty.find(params[:id])