app/controllers/timeslots_controller.rb

  def index
    @timeslots = Timeslot.all
---
SELECT "timeslots".* FROM "timeslots"

  def create
    @timeslot = Timeslot.new(timeslot_params)

    respond_to do |format|
      if @timeslot.save
---
INSERT INTO "timeslots" ("timeslot", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["timeslot", "9am - 10am"], ["created_at", 2016-10-05 09:53:28 UTC], ["updated_at", 2016-10-05 09:53:28 UTC]]

    def set_timeslot
      @timeslot = Timeslot.find(params[:id])
---
SELECT  "timeslots".* FROM "timeslots" WHERE "timeslots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]