app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def index
    @user = User.where(:id => current_user.id)

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "admin@a.com"], ["password_digest", "$2a$10$mnEBPr1O4ibBqSLoV4wPSOq55JMv0c.hfDcyj0QjctgM9eHcqCZFG"], ["created_at", 2016-10-05 08:26:32 UTC], ["updated_at", 2016-10-05 08:26:32 UTC]]
INSERT INTO "patients" ("user_id", "name", "allergy", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "3"], ["name", "Lee Yi Hui"], ["allergy", "Sunlight"], ["created_at", 2016-10-05 13:45:46 UTC], ["updated_at", 2016-10-05 13:45:46 UTC]]
---
  def create
    @user = User.new(user_params)
    @patient = Patient.new(patient_params)

      if @user.save
        @patient.user_id = @user.id
        if @patient.save

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$fcLeqSVnzaVs5K1OlKUAYOA2X6ICfeNFZfzUGl58772x6ESikpD.S"], ["updated_at", 2016-10-05 13:43:50 UTC], ["id", 2]]
UPDATE "patients" SET "name" = $1, "allergy" = $2, "updated_at" = $3 WHERE "patients"."id" = $4  [["name", "Lee Yi Hui"], ["allergy", "Sunlight & People"], ["updated_at", 2016-10-05 14:38:43 UTC], ["id", 1]]
---
  def update
    set_user
    set_patient
    if @user.update(params.require(:user).permit(:email))
      if @patient.update(patient_params)

SELECT  "patients".* FROM "patients" WHERE "patients"."user_id" = $1 LIMIT $2  [["user_id", "4"], ["LIMIT", 1]]
---
    def set_patient
      @patient = Patient.where(user_id: @current_user.id).take