app/views/appointments/_form.html.erb

    <%= f.label :timeslot %>
    <%= f.select :timeslot_id, options_for_select(@timeslots.collect {|x| [x.timeslot, x.id]}) %>
---
SELECT "timeslots".* FROM "timeslots"

    <%= f.label :complaint %>
    <%= f.select :complaint_id, options_for_select(@complaints.collect {|x| [x.complaint, x.id]}) %>
---
SELECT "complaints".* FROM "complaints"