app/views/appointments/_form.html.erb

SELECT "days".* FROM "days"
---
    <%= f.label :day_id %>
    <%= f.select :date_id, Day.all.collect {|x| [x.date, x.id]} %>